# RebarCoupler Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarCoupler Class
Members See Also
---
Represents a rebar coupler element in Autodesk Revit.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public class RebarCoupler : Element
```

Visual Basic
---
```text
Public Class RebarCoupler _
	Inherits Element
```

Visual C++
---
```text
public ref class RebarCoupler : public Element
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Structure..::..RebarCoupler
# See Also
RebarCoupler Members
Autodesk.Revit.DB.Structure Namespace